<template>
  <section class="adv">
    <div class="container adv__in">
      <h2 class="adv__title"><strong>ПРЕИМУЩЕСТВА ТЕХНОЛОГИИ </strong> «МСБК»</h2>
      <div class="adv__info_row">
        <div class="adv__info">
          По теплоизоляционным свойствам полистиролбетон значительно превосходит кирпич и
          является лучшим среди легких бетонов. При заливке полистиролбетона исключается
          возникновение мест с повышенным теплообменом между наружным и внутренним
          контуром здания на протяжении всего периода эксплуатации.
        </div>
        <ul class="adv__info_list">
          <li class="adv__info_item">Высокая скорость возведения</li>
          <li class="adv__info_item">Идеальная геометрия стен и потолка</li>
          <li class="adv__info_item">Универсальность</li>
          <li class="adv__info_item">Экологичность</li>
          <li class="adv__info_item">Безупречная шумоизоляция</li>
          <li class="adv__info_item">Энергоэффективность</li>
          <li class="adv__info_item">Пожаропрочность</li>
          <li class="adv__info_item">Сейсмоустойчивость</li>
        </ul>
      </div>
      <div class="adv__about">
        <div class="adv__about_descr">
          <p>
            Древесная омыленная смола (СДО), входящая в состав полистиролбетона, подавляет
            рост патогенной микрофлоры (бактерий, грибов), т.е. препятствует образованию
            плесени и гниению.
          </p>
          <p>
            Входящие в состав полистиролбетона компоненты безопасны для здоровья и
            окружающей среды: вспененный полистирол используется для изготовления упаковок
            для продуктов, одноразовой посуды, детскихигрушек, одноразовых медицинских
            инструментов.
          </p>
          <p>
            Полистиролбетон в Двойном каркасе МСБК не препятствуютвоздухообмену, т. е.
            стены способны «дышать», а благодаря высокой паропроницаемости — регулировать
            влажность воздуха.
          </p>
        </div>
        <div class="adv__img_w">
          <img
            class="adv__img lg:aspect-auto aspect-square"
            src="http://2klstk.ru/wp-content/uploads/2025/07/4486-1.jpg"
          />
        </div>
      </div>
      <ul class="adv__adv_list grid lg:grid-cols-2 grid-cols-1 gap-20">
        <li class="adv__adv_item space-y-4" v-for="(item, i) in advList" :key="i">
          <div class="lg:text-30 text-20 flex gap-6">
            <span
              class="w-20 min-w-20 h-20 flex items-center justify-center bg-[#b2c593] p-5 rounded-full"
              >{{ i + 1 }}</span
            >{{ item.title }}
          </div>
          <div class="lg:text-20">{{ item.description }}</div>
        </li>
      </ul>
    </div>
  </section>
</template>

<script setup lang="ts">
const advList = [
  {
    title: "Долговечность свыше 100 лет и сейсмостойкость до 9 баллов",
    description:
      "обеспечат капитальный свайно-ростверковый фундамент и монолитная сталебетонная стена",
  },
  {
    title: "Экономия на отоплении и комфортный микроклимат",
    description:
      "благодаря высокой энергоэффективности строения, заполненного теплоизолирующего и шумоизолирующего материала полистиролбетона",
  },
  {
    title: "Безопасность",
    description:
      "все материалы, использующиеся для строительства каркасно-монолитных домов, имеют высокий уровень пожарной и экологической безопасности",
  },
  {
    title: "Внешний вид на любой вкус",
    description:
      "от суперсовременного навесного фасада до классической кирпичной кладки с возможностью полного обновления фасада в процессе эксплуатации",
  },
  {
    title: "Срок строительства дома",
    description:
      "от 60 дней – это инновационный подход к возведению жилья, который сочетает в себе современные технологии и стандартные строительные процедуры. Сокращает время без ущерба для качества.",
  },
  {
    title: "Экономия времени и денег на ремонт и отделку",
    description:
      "безусадочная технология позволит приступить к отделке сразу же после возведения коробки дома, технология обеспечит идеально ровные углы и поверхности, готовую предчистовую отделку",
  },
];
</script>

<style scoped lang="scss"></style>
